OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_VENDOR_LBK/vendor_lbk.c
/***************************************************************************//**
 * @file     vendor_lbk.c
 * @version  V3.00
 * @brief    HSUSBD vendor loopback device sample file.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2021 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

/*!<Includes */
#include <string.h>
#include "NuMicro.h"
#include "vendor_lbk.h"

//#define USE_CPU

volatile uint8_t  g_IsHighSpeedMode = 1;
volatile uint8_t  g_IntInDataEmpty = 0;
volatile uint8_t  g_IsoInDataEmpty = 0;
volatile uint8_t  g_IsoOutDataReady = 0;
volatile uint8_t  g_BulkInDataEmpty = 0;
volatile uint8_t  g_BulkOutDataReady = 0;
volatile uint32_t g_DMA_RunMsk = 0;

__attribute__((aligned(4))) volatile uint8_t g_Ctrl_Buff[512];
__attribute__((aligned(4))) volatile uint8_t g_Int_Buff[1024];
__attribute__((aligned(4))) volatile uint8_t g_Bulk_Buff[512];
__attribute__((aligned(4))) volatile uint8_t g_Iso_Buff[1024];

uint32_t g_u32EpAMaxPacketSize;
uint32_t g_u32EpBMaxPacketSize;
uint32_t g_u32EpCMaxPacketSize;
uint32_t g_u32EpDMaxPacketSize;
uint32_t g_u32EpEMaxPacketSize;
uint32_t g_u32EpFMaxPacketSize;

void LBK_InitForHighSpeed(void);
void LBK_InitForFullSpeed(void);
void EPB_Handler(void);

/*--------------------------------------------------------------------------*/
/**
 * @brief       HSUSBD Interrupt Service Routine
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is the HSUSBD ISR
 */
NVT_ITCM void HSUSBD_IRQHandler(void)
{
    __IO uint32_t IrqStL, IrqSt;

    IrqStL = HSUSBD->GINTSTS & HSUSBD->GINTEN;    /* get interrupt status */

    if (!IrqStL)    return;

    /* USB interrupt */
    if (IrqStL & HSUSBD_GINTSTS_USBIF_Msk)
    {
        IrqSt = HSUSBD->BUSINTSTS & HSUSBD->BUSINTEN;

        if (IrqSt & HSUSBD_BUSINTSTS_SOFIF_Msk)
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_SOFIF_Msk);

        if (IrqSt & HSUSBD_BUSINTSTS_RSTIF_Msk)
        {
            HSUSBD_SwReset();

            HSUSBD_ResetDMA();
            HSUSBD->EP[EPA].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
            HSUSBD->EP[EPB].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
            HSUSBD->EP[EPC].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
            HSUSBD->EP[EPD].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
            HSUSBD->EP[EPE].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
            HSUSBD->EP[EPF].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;

            g_DMA_RunMsk = 0;

            if (HSUSBD->OPER & 0x04)  /* high speed */
                LBK_InitForHighSpeed();
            else                    /* full speed */
                LBK_InitForFullSpeed();

            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            HSUSBD_SET_ADDR(0);
            HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_RSTIF_Msk);
            HSUSBD_CLR_CEP_INT_FLAG(0x1ffc);

            printf("#RST\n");
            g_IntInDataEmpty = 1;
            g_IsoInDataEmpty = 1;
            g_IsoOutDataReady = 0;
            g_BulkInDataEmpty = 1;
            g_BulkOutDataReady = 0;
        }

        if (IrqSt & HSUSBD_BUSINTSTS_RESUMEIF_Msk)
        {
            HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_RESUMEIF_Msk);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_SUSPENDIF_Msk)
        {
            HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_SUSPENDIF_Msk);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_HISPDIF_Msk)
        {
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_HISPDIF_Msk);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_DMADONEIF_Msk)
        {
            //printf("IRQ, DMACTL = 0x%x\n", HSUSBD->DMACTL);

            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_DMADONEIF_Msk);

            if (HSUSBD->DMACTL & HSUSBD_DMACTL_DMARD_Msk)
            {
                if (g_hsusbd_ShortPacket == 1)
                {
                    printf("DMA IRQ g_hsusbd_ShortPacket==1\n");
                    HSUSBD->EP[EPA].EPRSPCTL = (HSUSBD->EP[EPA].EPRSPCTL & 0x10) | HSUSBD_EP_RSPCTL_SHORTTXEN;    // packet end
                    g_hsusbd_ShortPacket = 0;
                }
            }

            /*
             *  Is this DMA complete interrupt for isochronous-in?
             */
            if ((HSUSBD->DMACTL & 0xf) == ISO_IN_EP_NUM)
                g_DMA_RunMsk &= ~(1 << ISO_IN_EP_NUM);

            /*
             *  Is this DMA complete interrupt for isochronous-out?
             */
            if ((HSUSBD->DMACTL & 0xf) == ISO_OUT_EP_NUM)
                g_DMA_RunMsk &= ~(1 << ISO_OUT_EP_NUM);

            /*
             *  Is this DMA complete interrupt for bulk-in?
             */
            if ((HSUSBD->DMACTL & 0xf) == BULK_IN_EP_NUM)
                g_DMA_RunMsk &= ~(1 << BULK_IN_EP_NUM);

            /*
             *  Is this DMA complete interrupt for bulk-out?
             */
            if ((HSUSBD->DMACTL & 0xf) == BULK_OUT_EP_NUM)
                g_DMA_RunMsk &= ~(1 << BULK_OUT_EP_NUM);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk)
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk);

        if (IrqSt & HSUSBD_BUSINTSTS_VBUSDETIF_Msk)
        {
            if (HSUSBD_IS_ATTACHED())
            {
                /* USB Plug In */
                HSUSBD_ENABLE_USB();
            }
            else
            {
                /* USB Un-plug */
                HSUSBD_DISABLE_USB();
            }

            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_VBUSDETIF_Msk);
        }
    }

    if (IrqStL & HSUSBD_GINTSTS_CEPIF_Msk)
    {
        IrqSt = HSUSBD->CEPINTSTS & HSUSBD->CEPINTEN;

        if (IrqSt & HSUSBD_CEPINTSTS_SETUPTKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_SETUPTKIF_Msk);
            goto EXIT_HSUSBD_IRQHandler;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_SETUPPKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_SETUPPKIF_Msk);
            HSUSBD_ProcessSetupPacket();
            goto EXIT_HSUSBD_IRQHandler;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_OUTTKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_OUTTKIF_Msk);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            goto EXIT_HSUSBD_IRQHandler;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_INTKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);

            if (!(IrqSt & HSUSBD_CEPINTSTS_STSDONEIF_Msk))
            {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_TXPKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_TXPKIEN_Msk);
                HSUSBD_CtrlIn();
            }
            else
            {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_TXPKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_TXPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            }

            goto EXIT_HSUSBD_IRQHandler;
        }

