OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_VENDOR_LBK/vendor_lbk.c
        if (!HSUSBD_IS_ATTACHED())
            break;

        if (get_ticks() - t0 > 100)
        {
            printf("Warning!! LBK_GetBulkOutData DMA time-out!\n");
            break;
        }
    }
}

static void LBK_PrepareBulkInData(void)
{
    uint32_t  t0;

#if !defined(USE_CPU)
    /* bulk in, dma read */
    HSUSBD_SET_DMA_READ(BULK_IN_EP_NUM);
    HSUSBD_ENABLE_EP_INT(EPE, HSUSBD_EPINTEN_TXPKIEN_Msk);
    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    g_DMA_RunMsk |= (1 << BULK_IN_EP_NUM);

    HSUSBD_SET_DMA_ADDR((uint32_t)g_Bulk_Buff);
    HSUSBD_SET_DMA_LEN(g_u32EpEMaxPacketSize);
    HSUSBD_ENABLE_DMA();

    t0 = get_ticks();

    while (1)
    {
        if ((g_DMA_RunMsk & (1 << BULK_IN_EP_NUM)) == 0)
            break;                      /* DMA done */

        if (!HSUSBD_IS_ATTACHED())
            break;

        if (get_ticks() - t0 > 100)
        {
            printf("Warning!! LBK_PrepareBulkInData DMA time-out!\n");
            break;
        }
    }

#else
    /* Prepare the data for next bulk-in transfer */
    int i;

    for (i = 0; i < g_u32EpEMaxPacketSize; i++)
    {
        HSUSBD->EP[EPE].EPDAT_BYTE = g_Bulk_Buff[i];
        __DSB();
    }

    HSUSBD->EP[EPE].EPTXCNT = g_u32EpEMaxPacketSize;
    HSUSBD_ENABLE_EP_INT(EPE, HSUSBD_EPINTEN_INTKIEN_Msk);
#endif
}

static void LBK_GetIsoOutData(void)
{
    uint32_t  t0;

    /* bulk out, dma write */
    HSUSBD_SET_DMA_WRITE(ISO_OUT_EP_NUM);

    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    g_DMA_RunMsk |= (1 << ISO_OUT_EP_NUM);

    HSUSBD_SET_DMA_ADDR((uint32_t)g_Iso_Buff);
    HSUSBD_SET_DMA_LEN(g_u32EpDMaxPacketSize);
    HSUSBD_ENABLE_DMA();

    t0 = get_ticks();

    while (1)
    {
        if ((g_DMA_RunMsk & (1 << ISO_OUT_EP_NUM)) == 0)
            break;                      /* DMA done */

        if (!HSUSBD_IS_ATTACHED())
            break;

        if (get_ticks() - t0 > 100)
        {
            printf("Warning!! LBK_GetIsoOutData DMA time-out!\n");
            break;
        }
    }
}

static void LBK_PrepareIsoInData(void)
{
#if !defined(USE_CPU)
    uint32_t  t0;

    HSUSBD_SET_DMA_READ(ISO_IN_EP_NUM);
    HSUSBD_ENABLE_EP_INT(EPC, HSUSBD_EPINTEN_TXPKIEN_Msk);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    g_DMA_RunMsk |= (1 << ISO_IN_EP_NUM);

    HSUSBD_SET_DMA_ADDR((uint32_t)g_Iso_Buff);
    HSUSBD_SET_DMA_LEN(g_u32EpCMaxPacketSize);
    HSUSBD_ENABLE_DMA();

    t0 = get_ticks();

    while (1)
    {
        if ((g_DMA_RunMsk & (1 << ISO_IN_EP_NUM)) == 0)
            break;                      /* DMA done */

        if (!HSUSBD_IS_ATTACHED())
            break;

        if (get_ticks() - t0 > 100)
        {
            printf("Warning!! LBK_PrepareIsoInData DMA time-out!\n");
            break;
        }
    }

#else
    /* Prepare the data for next bulk-in transfer */
    int i;

    for (i = 0; i < g_u32EpCMaxPacketSize; i++)
    {
        HSUSBD->EP[EPC].EPDAT_BYTE = g_Iso_Buff[i];
        __DSB();
    }

    HSUSBD->EP[EPC].EPTXCNT = g_u32EpCMaxPacketSize;
    HSUSBD_ENABLE_EP_INT(EPC, HSUSBD_EPINTEN_INTKIEN_Msk);
#endif
}

void VendorLBK_ProcessData(void)
{
    int         i;

    if (g_IntInDataEmpty)
    {
        g_IntInDataEmpty = 0;

        /* Prepare the data for next interrupt-in transfer */
        for (i = 0; i < g_u32EpAMaxPacketSize; i++)
            HSUSBD->EP[EPA].EPDAT_BYTE = g_Int_Buff[i];

        HSUSBD->EP[EPA].EPTXCNT = g_u32EpAMaxPacketSize;
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_INTKIEN_Msk);
    }

    if (g_IsoInDataEmpty && !(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
    {
        g_IsoInDataEmpty = 0;
        LBK_PrepareIsoInData();
    }

    if (g_IsoOutDataReady && !(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
    {
        g_IsoOutDataReady = 0;
        LBK_GetIsoOutData();
    }

    if (g_BulkOutDataReady && !(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
    {
        g_BulkOutDataReady = 0;
        LBK_GetBulkOutData();
    }

    if (g_BulkInDataEmpty && !(HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk))
    {
        g_BulkInDataEmpty = 0;
        LBK_PrepareBulkInData();
    }
}
